using System.Collections.ObjectModel;
using UNA.MobileApplication.Models;

public static class Data
{
    public static ObservableCollection<Place> places = new ObservableCollection<Place> {
            new Place
                {
                    Image = "http://www.una-oic.org//UploadDir//75925a1d-3e45-4a95-8cb5-aaddf02fe2ad.jpg",
                    Title = "الأمين العام لمنظمة التعاون الإسلامي يهنئ خادم الحرمين بمناسبة نجاح العملية الجراحية",
                    IsFeatured = true,
                    IsTrending = true,
                    SubTitle = "الخميس 02 ذو الحجة 1441 - 15:03 بتوقيت مكة المكرمة الموافق 23-7-2020",
                    Description = @"جدة (يونا) - أعرب الأمين العام لمنظمة التعاون الإسلامي الدكتور يوسف بن أحمد العثيمين، عن صادق تهانيه لخادم الحرمين الشريفين الملك سلمان بن عبد العزيز آل سعود، رئيس القمة الإسلامية الرابعة عشرة، ولشعب المملكة العربية السعودية، بمناسبة نجاح العملية الجراحية التي أجراها يوم الخميس (23 يوليو 2020).
ودعا الأمين العام الله عز وجل أن يديم على خادم الحرمين الشريفين، نعمة الصحة والعافية، ليواصل مسيرته في خدمة بلاده المملكة العربية السعودية وقضايا الأمة الإسلامية.
(انتهى)
ص ج/ ح ص",
                    //Images = new List<string>
                    //{
                    //    "https://www.aiglonmorzine.com/wp-content/uploads/2019/01/Annecy.jpg",
                    //    "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Palais_de_l%27Isle_-_Annecy_6-9-2017_10-19-19.JPG/1200px-Palais_de_l%27Isle_-_Annecy_6-9-2017_10-19-19.JPG",
                    //    "https://img.theculturetrip.com/768x432/wp-content/uploads/2018/08/shutterstock_547692802.jpg"
                    //}
                },
                new Place
                {
                    Image = "http://www.una-oic.org//UploadDir//f07c2113-0ae2-47f0-9577-18fee3d85006.jpg",
                    Title = @"(السعودية والصين .. تاريخ حافل وآفاق مستقبلية مشرقة) ندوة في مكتبة الملك عبدالعزيز العامة",
                    IsPopular = true,
                    SubTitle = "الخميس 02 ذو الحجة 1441 - 15:03 بتوقيت مكة المكرمة الموافق 23-7-2020",
                    Description = @"الرياض (يونا) ـــ نظمت مكتبة الملك عبدالعزيز السعودية العامة ندوة بعنوان المملكة العربية السعودية وجمهورية الصين الشعبية.. تاريخ حافل وآفاق مستقبلية مشرقة، بمناسبة مرور 30 عاماً على إقامة العلاقات الدبلوماسية بين البلدين.
ونوه المشاركون في الندوة بعمق العلاقات بينهما وبجذورها التاريخية، الممتدة لأكثر من 2000 عام، مؤكدين أن علاقاتهما تشهد اليوم تطوراً كبيراً في مختلف المجالات، وفرص التعاون بينهما واعدة.
وأكد المشرف العام على المكتبة فيصل بن معمر، أن العلاقات بين الحضارتين العربية والصينية، قائمة منذ فجر التاريخ، عبر طريق الحرير، وأنتجت مراكز للإشعاع الثقافي، وعملت على إرساء قواعد من التفاهم، وصولاً إلى هذه المرحلة الراهنة، التي تدعو للتفاؤل بمستقبل مشرق.
وأشار ابن معمر إلى ما أكد عليه خادم الحرمين الشريفين الملك سلمان بن عبدالعزيز في كلمته التي ألقاها خلال زيارته للصين عام 2017 م، باعتزازه بالعلاقات الثنائية والتعاون المشترك بين البلدين، وما يمر به البلدان من تحولات اقتصادية، وما تقوم به اللجنة المشتركة والتعاون الاستراتيجي بينهما، للإسهام في تحقيق الأمن والسلام الدوليين، والشراكة الاستراتيجية الكاملة، خاصة في العلاقات الاقتصادية والسياسية والثقافية، وتوسيع الشراكة الاقتصادية بما يعزز تدعيم رؤية المملكة 2030 والرؤية الصينية الحزام والطريق.
وأوضح أن الزيارات المتبادلة بين البلدين، تعمل على تعميق علاقاتهما، فهناك مصالح عميقة تربط الشعبين السعودي والصيني، إلى جانب التعاون الحضاري والثقافي، للانطلاق لآفاق أوسع.
وبين ابن معمر أن مكتبة الملك عبدالعزيز العامة قدمت لجامعتي بكين وشنغهاي، أربع مكتبات متخصصة لتعليم العربية لغير الناطقين بها، وتواصلاً لدعم اللغة العربية صدرت الموافقة على مشاريع ومذكرات تفاهم بين المكتبة والجامعات الصينية، ثم توجت بافتتاح فرع للمكتبة بجامعة بكين من أجل تعميق الشراكة الثقافية والمقومات الإنسانية بين البلدين، واستغرق بناء المكتبة 22 شهراً، وضمت ثلاثة ملايين كتاب، كما ضمت مركزاً للدراسات العربية، ومركزاً للمخطوطات، وسعت إلى تأسيس فعاليات ثقافية مشتركة بين البلدين، وتوج ذلك بزيارة خادم الحرمين الشريفين للصين وتدشينه المكتبة في عام 2017 م، وكان يوماً تاريخياً في العلاقات السعودية الصينية.
ولفت المشرف على المكتبة إلى أنه أنشئت بوابة إلكترونية للعلاقات مع الصين، أثناء زيارة ولي العهد السعودي للصين عام 2019 م، مشيراً إلى إعلان وزير الثقافة السعودي الأمير بدر بن عبد الله بن فرحان، عن جائزة الأمير محمد بن سلمان للتعاون الثقافي السعودي الصيني، وأصبحت من الأمور التي نفخر بها أن تكون المكتبة، مقراً لهذه الجائزة. مشيراً إلى توجيه ولي العهد بإدراج اللغة الصينية كمقرر في مدارس المملكة.
وقال: إن العلاقات السعودية الصينية عبرت تحت مظلة توجيهات سامية، وهي تتطور بشكل كبير وفي إطار التعاون الثقافي، ومن خلال اهتمام وزارة الثقافة، نرى مشاريع تلقى كل الدعم والرعاية.
من جهته أكد نائب وزير الثقافة السعودي حامد بن محمد فايز، أن هناك تقارباً وتعاوناً بين المملكة والصين على الأصعدة كافة، وأن العلاقات التي تمتد لأكثر من 2000 عام بنت جسوراً راسخة بين الجزيرة العربية والصين عبر التجارة وتقريب الحضارتين العريقتين، وهو ما يمثل شرياناً حيوياً للثقافة، وقال هذا يتم اليوم عبر طريقين هما: رؤية المملكة 2030 ومبادرة الصين: الحزام والطريق، وما ستحدثانه من أثر كبير على قارتنا والعالم أجمع.
وقال فايز: إن رؤية 2030 نبعت عبر قراءة عميقة للتاريخ ونظرة استشرافية طموحة للمستقبل من لدن حكومة المملكة، بقيادة خادم الحرمين الشريفين الملك سلمان بن عبد العزيز، وولي عهده الأمين، حيث جاءت الرؤية متناغمة مع طموحات المواطن السعودي وتطلعاته.
وأكد أن 2030 برؤيتها الثلاثية: المجتمع الحيوي، والاقتصاد المزدهر، والوطن الطموح، تؤسس لثلاثية سعودية بوصفها تشكل العمق العربي، والإسلامي، والريادة الاستثمارية ومحور ربط القارات الثلاث، وقال: لقد ألهمتنا الرؤية لنقدم في أول وزارة للثقافة السعودية، رؤيتنا الثلاثية الخاصة، حيث ترتكز الثقافة على نمط حياة للأفراد، وتشكل رافدا للنمو الاقتصادي، ونمواً لإثراء الحوار الثقافي.
​(انتهى)
ح ص",
                    //Images = new List<string>
                    //{
                    //    "https://i0.wp.com/dominicantreehousevillage.com/wp-content/uploads/2020/02/IMG_7514_1.jpg?resize=1024%2C683&ssl=1",
                    //    "https://i2.wp.com/dominicantreehousevillage.com/wp-content/uploads/2019/12/IMG_7511_72px.jpg?resize=800%2C1200&ssl=1",
                    //    "https://i2.wp.com/dominicantreehousevillage.com/wp-content/uploads/2020/02/DSC_5035_1.jpg?resize=819%2C1024&ssl=1"
                    //}
                },
                new Place
                {
                    Image = "http://www.una-oic.org//UploadDir//56235159-5d33-4014-84d0-ec76f4a98689.jpg",
                    Title = "160 جنسية يمثلون الحجاج المقيمين بالسعودية يؤدون المناسك هذا العام",
                    SubTitle = "السبت 04 ذو الحجة 1441 - 11:25 بتوقيت مكة المكرمة الموافق 25-7-2020",
                    IsFeatured = false,
                    IsTrending = true,
                    Description = @"الرياض (يونا) ـــ أكد نائب وزير الحج والعمرة السعودي الدكتور عبدالفتاح بن سليمان مشاط، وجود تنسيق كامل مع وزارتي الصحة والداخلية، لتطبيق البروتوكولات الصحية والأمنية، خلال موسم حج 1441هـ، الذي وصفه بـ الحج الاستثنائي من المقاييس الإجرائية والتنظيمية والصحية كافة.
وقال الدكتور مشاط: إن هناك 160 جنسية يمثلون كافة الحجاج المقيمين، الذين وقع عليهم الاختيار لأداء فريضة حج هذا العام، مؤكداً عدم وجود أي تفاضل في عملية الاختيار، إلا من ناحية المعايير الصحية التي وضعتها الجهات الصحية المعنية.
وذكر أن اختيار الحجاج المقيمين كان من خلال البوابة الإلكترونية، مشيراً إلى أن وزارة الحج والعمرة بدأت في تنفيذ خططها التنفيذية والتفصيلية لتنظيم موسم حج هذا العام منذ وقت مبكر، الذي يأتي في ظروف استنثنائية بسبب جائحة كورنا، مؤكداً على أخذ كافة التدابير الصحية والأمنية والتنظيمية، لإقامة مناسك الركن الخامس بسلام وأمان.
وأوضح المسؤول السعودي أنه تم تحديد قائد لكل مجموعة من الحجيج، لشرح الإجراءات الوقائية والرسائل الصحية، وليسهل التواصل معهم وإبلاغهم بالمستجدات أولاً بأول، وبالنسبة لإجراءات العزل، أكد على إلزام ضيوف الرحمن بارتداء الأساور الإلكترونية، للحرص على تطبيقهم للعزل المنزلي، قبل توجههم إلى المشاعر المقدسة، على أن يخضعوا للحجر المؤسسي من اليوم الرابع وحتى الثامن من ذي الحجة في مكة المكرمة.
(انتهى)
ح ص",
                    //Images = new List<string>
                    //{
                    //    "https://images.trvl-media.com/hotels/30000000/29850000/29842500/29842432/007daf59.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    //    "https://images.trvl-media.com/hotels/30000000/29850000/29842500/29842432/bdce79e8.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    //    "https://images.trvl-media.com/hotels/30000000/29850000/29842500/29842432/71afef03.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium"
                    //}
                },
                new Place
                {
                    Image = "http://www.una-oic.org//UploadDir//3718b9b1-a5ca-4864-981e-cc960a1f1414.jpeg",
                    Title = "أذربيجان تبلغ منظمة الفاو بأضرار القطاع الزراعي جراء العدوان الأرميني",
                    SubTitle = "الخميس 02 ذو الحجة 1441 - 15:01 بتوقيت مكة المكرمة الموافق 23-7-2020",
                    Description = @" باكو  (يونا) -  أعلنت رئيسة هيئة الصادرات الزراعية والتموين في أذربيجان ليلى محمدوفا، أن بلادها أبلغت منظمة الأغذية والزراعة (فاو) التابعة للأمم المتحدة - ومقرها روما -  بالأضرار التي لحقت بالقطاع الزراعي الأذربيجاني جراء الاشتباكات الحدودية التي تسببت بها القوات الأرمينية، وأنها أطلعت خبراء المنظمة على تفاصيل هذه الأضرار.
وقالت محمدوفا، في تصريحات صحفية اليوم الخميس: لقد قمت بتقديم معلومات تفصيلية إلى الخبراء في منظمة الأغذية والزراعة بشأن السياسة التي يمارسها الجانب الأرميني ضد أذربيجان، وتحدثت معهم  خلال اجتماع - عبر الاتصال المرئي- اليوم، عن الأضرار التي لحقت بالقطاع الزراعي جراء إطلاق النار من أرمينيا على بلادنا في الأسبوعين الماضيين.
وشارك في الاجتماع خبراء من المنظمة وعددٍ من ممثلي وزارة الزراعة في أذربيجان الذين قدموا معلومات تفصيلية بشأن السياسة العدائية التي يمارسها الجانب الأرميني ضد أذربيجان، وإطلاق النار المنتظم ضد المدنيين والمزارعين الأذريين الذين يعيشون في المناطق الحدودية ويعملون في قطاع الزراعة.
من ناحية أخرى، تطرق الاجتماع إلى النقاط التي تتعلق بالأهداف التنموية لسيدات الأعمال على الرغم من التحديات غير المسبوقة التي أسفرت عنها جائحة (كوﭬيد-19)، وكذلك قرار إعادة فتح الأعمال بشكل أوسع في المستقبل القريب مع النساء المزارعات اللاتي يقطن في المناطق الحدودية التي تم إطلاق النار عليها من قِبل الجيش الأرميني.
وأوضحت محمدوفا، أن هذا المشروع كان قد أطلق بإشراف (الفاو) ووزارة الزراعة في أذربيجان، لتحسين الأمن الغذائي والتنمية الريفية الشاملة وتمكين المرأة الريفية عن طريق تعزيز سبل العيش المستدامة، ومساعدتهن ودعمهن في ممارسة وتطوير مشاريعهن في القطاع الزراعي.
((انتهى))
ح ع/ ح ص",
                    //Images = new List<string>
                    //{
                    //    "https://images.trvl-media.com/hotels/21000000/20650000/20643300/20643202/e5b6b220.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    //    "https://images.trvl-media.com/hotels/21000000/20650000/20643300/20643202/5a6e566a.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    //    "https://images.trvl-media.com/hotels/21000000/20650000/20643300/20643202/330ae047.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium",
                    //    "https://images.trvl-media.com/hotels/21000000/20650000/20643300/20643202/e59e8184.jpg?impolicy=fcrop&w=1200&h=800&p=1&q=medium"
                    //}
                },
                new Place
                {
                    Image = "http://www.una-oic.org//UploadDir//e99972ea-2667-4be7-966c-5c4634068f37.jpg",
                    IsPopular = true,
                    Title = "الرئيس المصري يجدد التأكيد على ثوابت بلاده بشأن (سد النهضة)",
                    SubTitle = "الأحد 05 ذو الحجة 1441 - 09:55 بتوقيت مكة المكرمة الموافق 26-7-2020",
                    Description = @"القاهرة (يونا) ـــ جدد الرئيس المصري عبدالفتاح السيسي، التأكيد على ثوابت بلاده، بشأن (سد النهضة) الإثيوبي، خاصة فيما يتعلق ببلورة اتفاق قانوني مكتمل الجوانب بين الأطراف المعنية، حول قواعد ملء السد وتشغيله.
جاء ذلك خلال اتصال هاتفي تلقاه السيسي من رئيس جنوب افريقيا سيريل رامافوزا، الذي تتولى بلاده حالياً الرئاسة الدورية للاتحاد الافريقي، بحسب ما ذكر المتحدث باسم الرئاسة المصرية السفير بسام راضي.
وبحسب المتحدث باسم الرئاسة المصرية، فإن الرئيس السيسي أكد خلال الاتصال رفض أي عمل أو إجراء أحادي الجانب من شأنه المساس بحقوق مصر في مياه النيل، وأضاف المتحدث: إن رامافوزا أعرب من جانبه عن تطلعه لاستمرار التنسيق المكثف بين البلدين، بشأن قضية السد، وصولاً إلى اتفاق عادل ومتوازن لجميع الأطراف بشأن هذا الملف الحيوي.
وأشار راضي إلى ان الاتصال تناول متابعة تطورات ملف (سد النهضة)، في إطار ما تم مناقشته خلال القمة الافريقية المصغرة، التي انعقدت الثلاثاء الماضي.
وتتخوف مصر من تأثير (سد النهضة)، الذي تبنيه إثيوبيا على النيل الأزرق على حصتها السنوية من مياه النيل البالغة 55.5 مليار متر مكعب، بينما يؤكد الجانب الإثيوبي أن السد لن يمثل خطراً على السودان ومصر.
ويقع (سد النهضة) على بعد 15 كيلومتراً من الحدود السودانية، وتبلغ سعته التخزينية 74 مليار متر مكعب، وينتظر أن يولد طاقة كهربائية تصل إلى نحو ستة آلاف ميغاواط.
(انتهى)
ص ج/ ح ص",
                    //Images = new List<string>
                    //{
                    //    "https://www.aiglonmorzine.com/wp-content/uploads/2019/01/Annecy.jpg",
                    //    "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Palais_de_l%27Isle_-_Annecy_6-9-2017_10-19-19.JPG/1200px-Palais_de_l%27Isle_-_Annecy_6-9-2017_10-19-19.JPG",
                    //    "https://img.theculturetrip.com/768x432/wp-content/uploads/2018/08/shutterstock_547692802.jpg"
                    //}
                },
                new Place
                {
                    Image = "http://www.una-oic.org//UploadDir//380a145e-e89b-4a10-a641-6900490a3c5e.jpg",
                    Title = "الإفتاء المصرية تجيز شراء الأضحية أونلاين بشرط محدد",
                    IsFeatured = true,
                    SubTitle = "السبت 04 ذو الحجة 1441 - 16:53 بتوقيت مكة المكرمة الموافق 25-7-2020",
                    Description = @"القاهرة (يونا) ـــ أفتت دار الإفتاء المصرية بجواز شراء الأضحية عبر الأونلاين، بشرط زوال الغرر، وقالت الدار في فتوى، تلقى اتحاد وكالات أنباء دول منظمة التعاون الإسلامي يونا نسخة منه: إن شراء الأضحية أون لاين جائزٌ شرعًا ولا حرج فيه؛ لأنَّ الأصل في المعاملات الإباحة، إلَّا ما ورد الشرع بتحريمه، وما دام أَنَّ الشراء عن طريق التسويق الإلكتروني يشتمل على مُقوِّمات البيع الشرعي أركانًا وشروطاً، ما يرتبط بالصيغة والعاقدين والمحل؛ فلا مانع منه شرعًا.
وأوضحت الدار في فتوى لها أن المقصود بالشراء أون لاين online: هو الشراء عن طريق التسويق الإلكتروني، الذي يعتمد على عرض البائع لتفاصيل المنتج وكيفية تسليمه، لافتةً إلى أن جمهور الفقهاء نصوا على صحة بيع العين الغائبة الموصوفة؛ وهو ما ذهب إليه الحنفية، والمالكية، وهو المعتمد عن الحنابلة، وأحد القولين عند الشافعية.
وأشارت الدار إلى أنه إذا وُصِفت الأضحية عن طريق البائع، بما يزيل الغَرَر والجهالة عند المشتري؛ فالبيع صحيح، إذا استكمل الشروط العامة للبيع، وللمشتري الرجوع على البائع في حالة عدم موافقة الصفة لواقع الأضحية التي اشتراها؛ فيثبت للمشتري ما يُسَمَّى خيار فوات الوصف، وهو حقُّ الفسخ لتخلف وصفٍ مرغوبٍ اشترطهُ العاقدُ في المعقود عليه.
(انتهى)
ح ع/ ح ص",
                    //Images = new List<string>
                    //{
                    //    "https://media.cntraveler.com/photos/5d921b84d19ce4000851d902/master/w_1200,c_limit/Tongabezi-&-Sindabezi_2019_IMG_5206-1.jpg",
                    //    "https://media.cntraveler.com/photos/5d921b846168d9000af15c45/master/w_1200,c_limit/Tongabezi-&-Sindabezi_2019_IMG_5408-1.jpg",
                    //    "https://media.cntraveler.com/photos/5d921b8537c3f70009b84f9d/master/w_1200,c_limit/Tongabezi-&-Sindabezi_2019_Tongabezi_March18-62.jpg"
                    //}
                }
        };
}